Repository: dotnet/deployment-tools
Catalog: src/Microsoft.Deployment.DotNet.Releases/src/xlf/ReleasesResources.*.xlf
Languages: cs, es, ja, ko, pl, pt_br, ru, zh_hant

# AspNetCoreReleaseName
source: ASP.NET Core Runtime
cs: Modul runtime ASP.NET Core
ja: ASP.NET Core ランタイム
ko: ASP.NET Core 런타임
pl: Środowisko uruchomieniowe platformy ASP.NET Core
pt_br: Runtime do ASP.NET Core
ru: Среда выполнения ASP.NET Core
zh_hant: ASP.NET Core 執行階段

# FileNotFound
source: Could not find the specified file: {0}
cs: Nepovedlo se najít zadaný soubor: {0}
es: No se encontró el archivo especificado: {0}
ja: 指定されたファイルが見つかりませんでした: {0}
ko: 지정된 파일 {0}을(를) 찾을 수 없습니다.
pl: Nie można znaleźć określonego pliku: {0}
pt_br: Não foi possível localizar o arquivo especificado: {0}
ru: Не удалось найти указанный файл: {0}
zh_hant: 找不到指定的檔案: {0}

# HashMismatch
source: The expected hash ({0}) and actual hash ({1}) for {2} do not match.
cs: Očekávaná hodnota hash ({0}) a skutečná hodnota hash ({1}) pro {2} nejsou stejné.
es: El hash que se esperaba ({0}) y el hash real ({1}) para {2} no coinciden.
ja: {2} の必要なハッシュ ({0}) と実際のハッシュ ({1}) が一致しません。
ko: {2}의 필요한 해시({0})와 실제 해시({1})가 일치하지 않습니다.
pl: Oczekiwany skrót ({0}) i rzeczywisty skrót ({1}) elementu {2} nie są zgodne.
pt_br: O hash esperado ({0}) e o hash real ({1}) de {2} não correspondem.
ru: Ожидаемый хэш ({0}) и фактический хэш ({1}) для {2} не совпадают.
zh_hant: 預期的雜湊 ({0}) 與 {2} 的實際雜湊 ({1}) 不相符。

# InvalidBuildMetadata
source: The build metadata value is invalid: {0}
cs: Hodnota metadat sestavení není platná: {0}
es: El valor de los metadatos de compilación no es válido: {0}
ja: ビルド メタデータの値が無効です: {0}
ko: 빌드 메타데이터 값이 잘못되었습니다. {0}
pl: Wartość metadanych kompilowania jest nieprawidłowa: {0}
pt_br: O valor de metadados do build é inválido: {0}
ru: Недопустимое значение метаданных сборки: {0}
zh_hant: 建置中繼資料值無效: {0}

# InvalidMajorVersion
source: Invalid or missing major version.
cs: Hlavní verze není platná nebo chybí.
es: Falta la versión principal o no es válida.
ja: メジャー バージョンが無効か、見つかりません。
ko: 주 버전이 잘못되었거나 없습니다.
pl: Brak wersji głównej lub jest ona nieprawidłowa.
pt_br: Versão principal inválida ou ausente.
ru: Основной номер версии является недопустимым или отсутствует.
zh_hant: 主要版本無效，或缺少主要版本。

# InvalidMinorVersion
source: Invalid or missing minor version.
cs: Podverze není platná nebo chybí.
es: Falta la versión secundaria o no es válida.
ja: マイナー バージョンが無効か、存在しません。
ko: 부 버전이 잘못되었거나 없습니다.
pl: Brak wersji pomocniczej lub jest ona nieprawidłowa.
pt_br: Versão secundária inválida ou ausente.
ru: Дополнительный номер версии является недопустимым или отсутствует.
zh_hant: 次要版本無效，或缺少次要版本。

# InvalidPatch
source: Invalid or missing patch version.
cs: Verze opravy není platná nebo chybí.
es: Falta la versión de revisión o no es válida.
ja: 修正プログラムのバージョンが無効か、見つかりません。
ko: 패치 버전이 잘못되었거나 없습니다.
pl: Brak wersji poprawki lub jest ona nieprawidłowa.
pt_br: Versão de patch inválida ou ausente.
ru: Версия исправления является недопустимой или отсутствует.
zh_hant: 修補檔版本無效，或缺少修補檔版本。

# InvalidPrerelease
source: The prerelease value is invalid: {0}
cs: Hodnota předběžné verze není platná: {0}
es: El valor de versión preliminar no es válido: {0}
ja: プレリリースの値が無効です: {0}
ko: 시험판 값이 잘못되었습니다. {0}
pl: Wartość wersji wstępnej jest nieprawidłowa: {0}
pt_br: O valor de pré-lançamento é inválido: {0}
ru: Значение предварительного выпуска является недопустимым: {0}
zh_hant: 發行前的值無效: {0}

# InvalidVersion
source: Invalid version: {0}
cs: Neplatná verze: {0}
es: Versión no válida: {0}
ko: 잘못된 버전: {0}

# RuntimeReleaseName
source: .NET Core Runtime
cs: Modul runtime .NET Core
ja: .NET Core ランタイム
ko: .NET Core 런타임
pl: Środowisko uruchomieniowe platformy .NET Core
pt_br: Runtime do .NET Core
ru: Среда выполнения .NET Core
zh_hant: .NET Core 執行階段

# SdkReleaseName
source: SDK
cs: Sada SDK
ru: Пакет SDK

source: Value cannot be empty.
cs: Hodnota nesmí být prázdná.
es: El valor no puede estar vacío.
ja: 値を空にすることはできません。
ko: 값은 비워 둘 수 없습니다.
pl: Wartość nie może być pusta.
pt_br: O valor não pode ser vazio.
ru: Значение не может быть пустым.
zh_hant: 值不可以空白。

# VersionPartLessThanZero
source: The '{0}' value cannot be less than 0.
cs: Hodnota {0} nemůže být menší než 0.
es: El valor "{0}" no puede ser menor que 0.
ko: '{0}' 값은 0보다 작을 수 없습니다.

# WindowsDesktopReleaseName
source: Desktop Runtime
es: Entorno de ejecución de escritorio
ja: デスクトップ ランタイム
ko: 데스크톱 런타임
pl: Klasyczne środowisko uruchomieniowe
pt_br: Runtime do Desktop
ru: Среда выполнения классических приложений
zh_hant: 桌面執行階段
